codes = """
206201
206201
206201
206201
206201
206202
206202
600210
600210
600210
600210
206101
206601
206702
206702
206702
206801
206801
206801
211101
231038
600210
600210
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
364101
231039
231039
231039
231038
231038
231038
231038
231038
231038
231038
231038
231038
231038
231038
231038
231038
231038
231039
240709
241603
240709
240709
242003""".strip().splitlines()

HEADER_MAPPING = {
    'year': 'שנת תקציב',
    'code_level8': 'מספר תקנה',
    'title_level2': 'שם משרד',
    'title_level6': 'שם תכנית',
    'title_level8': 'שם תקנה',
    'net_allocated': 'תקציב תקנה',
    'net_revised': 'תקציב על שינוייו',
    'net_executed': 'ביצוע'
}
SELECT = ', '.join('%s AS "%s"' % i for i in HEADER_MAPPING.items())

QUERY = f"""
SELECT {SELECT}
FROM raw_budget
WHERE code IN ({', '.join("'00%s'" % code for code in codes)})"""

if __name__ == '__main__':
    print(QUERY)